stress-test-results/get_records_low_20250617_203142.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/quality-records?limit=20&page=1
Document Length:        11153 bytes

Concurrency Level:      5
Time taken for tests:   0.642 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      5698500 bytes
HTML transferred:       5576500 bytes
Requests per second:    778.80 [#/sec] (mean)
Time per request:       6.420 [ms] (mean)
Time per request:       1.284 [ms] (mean, across all concurrent requests)
Transfer rate:          8667.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     4    6   1.6      6      17
Waiting:        4    6   1.5      6      17
Total:          4    6   1.6      6      17

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      7
  80%      7
  90%      8
  95%      9
  98%     10
  99%     11
 100%     17 (longest request)