stress-test-results/pool_status_20250617_203142.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/quality-records/pool-status
Document Length:        139 bytes

Concurrency Level:      5
Time taken for tests:   0.101 seconds
Complete requests:      500
Failed requests:        485
   (Connect: 0, Receive: 0, Length: 485, Exceptions: 0)
Total transferred:      189015 bytes
HTML transferred:       69015 bytes
Requests per second:    4930.19 [#/sec] (mean)
Time per request:       1.014 [ms] (mean)
Time per request:       0.203 [ms] (mean, across all concurrent requests)
Transfer rate:          1820.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    1   0.8      1       8
Waiting:        0    1   0.8      1       8
Total:          0    1   0.8      1       8

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      3
  99%      7
 100%      8 (longest request)