stress-test-results/stats_by_second_20250617_203142.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /api/quality-records/by-second?limit=60&page=1
Document Length:        384402 bytes

Concurrency Level:      5
Time taken for tests:   7.906 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      76929600 bytes
HTML transferred:       76880400 bytes
Requests per second:    25.30 [#/sec] (mean)
Time per request:       197.661 [ms] (mean)
Time per request:       39.532 [ms] (mean, across all concurrent requests)
Transfer rate:          9501.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    76  195  26.7    197     272
Waiting:       76  195  26.7    196     271
Total:         76  195  26.7    197     272

Percentage of the requests served within a certain time (ms)
  50%    197
  66%    205
  75%    211
  80%    214
  90%    229
  95%    240
  98%    251
  99%    271
 100%    272 (longest request)